{
  "diabetes_reference_data": {
    "parameters": {
      "fasting_blood_glucose": {
        "parameter_name": "Fasting Blood Glucose",
        "code": "1558-6",
        "units": "mg/dL",
        "reference_ranges": {
          "low": {
            "cut_off": "< 70 (< 3.9 mmol/L)",
            "result": "Low"
          },
          "normal": {
            "cut_off": "70 to <= 108 (3.9 - 6.0 mmol/L)",
            "result": "Normal"
          },
          "elevated": {
            "cut_off": "> 108 (> 6.1 mmol/L)",
            "result": "Pre-Diabetic and Diabetic"
          }
        }
      },
      "hba1c": {
        "parameter_name": "HbA1c",
        "code": "4548-4",
        "units": "%",
        "reference_ranges": {
          "normal": {
            "cut_off": "<= 6.0",
            "result": "Normal"
          },
          "pre_diabetic": {
            "cut_off": "6.1-6.9",
            "result": "Pre-diabetic"
          },
          "diabetic": {
            "cut_off": ">= 7.0",
            "result": "Diabetic"
          }
        },
        "diabetic_control_ranges": {
          "well_controlled": {
            "cut_off": "<= 7.0",
            "result": "Well-Controlled"
          },
          "sub_optimally_controlled": {
            "cut_off": "7.1 - 8.0",
            "result": "Sub-optimally Controlled"
          },
          "poorly_controlled": {
            "cut_off": "> 8.0",
            "result": "Poorly-Controlled"
          }
        }
      }
    },
    "interpretation_scenarios": {
      "no_pre_diagnosed_diabetes": [
        {
          "fbg_range": "> 108",
          "fbg_result": "Pre-Diabetic and Diabetic",
          "hba1c_range": "Not specified",
          "hba1c_result": "Not specified",
          "recommendations": "Your fasting blood glucose level is raised. This suggests the possibility of diabetes. An Oral Glucose Tolerance Test (OGTT) and HbA1c test are recommended. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "Not specified",
          "fbg_result": "Not specified",
          "hba1c_range": "6.1-6.9",
          "hba1c_result": "Pre-diabetic",
          "recommendations": "Your HbA1c level is raised. This suggests the possibility of pre-diabetes. An Oral Glucose Tolerance Test (OGTT) is recommended. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "Not specified",
          "fbg_result": "Not specified",
          "hba1c_range": ">= 7.0",
          "hba1c_result": "Diabetic",
          "recommendations": "Your HbA1c level is raised. This suggests the possibility of diabetes. An Oral Glucose Tolerance Test (OGTT) is recommended. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "< 70",
          "fbg_result": "Low",
          "hba1c_range": "<= 6.0",
          "hba1c_result": "Normal",
          "recommendations": ""
        },
        {
          "fbg_range": "< 70",
          "fbg_result": "Low",
          "hba1c_range": "6.1-6.9",
          "hba1c_result": "Pre-diabetic",
          "recommendations": "Your fasting blood glucose level is borderline low. It could be due to prolonged fasting. However, your HbA1c level is raised. This suggests the possibility of pre-diabetes. An Oral Glucose Tolerance Test (OGTT) is recommended. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "< 70",
          "fbg_result": "Low",
          "hba1c_range": ">= 7.0",
          "hba1c_result": "Diabetic",
          "recommendations": "Your fasting blood glucose level is borderline low. It could be due to prolonged fasting. However, your HbA1c level is raised. This suggests the possibility of diabetes. An Oral Glucose Tolerance Test (OGTT) is recommended. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "70 to <= 108",
          "fbg_result": "Normal",
          "hba1c_range": "<= 6.0",
          "hba1c_result": "Normal",
          "recommendations": ""
        },
        {
          "fbg_range": "70 to <= 108",
          "fbg_result": "Normal",
          "hba1c_range": "6.1-6.9",
          "hba1c_result": "Pre-diabetic",
          "recommendations": "Your fasting blood glucose level is within normal limits, but your HbA1c level is above the normal limits. This suggests the possibility of pre-diabetes. An Oral Glucose Tolerance Test (OGTT) is recommended. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "70 to <= 108",
          "fbg_result": "Normal",
          "hba1c_range": ">= 7.0",
          "hba1c_result": "Diabetic",
          "recommendations": "Your fasting blood glucose level is within normal limits, but your HbA1c level is raised. This suggests the possibility of diabetes. An Oral Glucose Tolerance Test (OGTT) is recommended. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "> 108",
          "fbg_result": "Pre-Diabetic and Diabetic",
          "hba1c_range": "<= 6.0",
          "hba1c_result": "Normal",
          "recommendations": "Your fasting blood glucose level is raised, but your HbA1c level is within normal limits. This suggests the possibility of pre-diabetes. A repeat fasting glucose test or Oral Glucose Tolerance Test (OGTT) is  recommended. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "> 108",
          "fbg_result": "Pre-Diabetic and Diabetic",
          "hba1c_range": "6.1-6.9",
          "hba1c_result": "Pre-diabetic",
          "recommendations": "Both your fasting blood glucose and HbA1c levels are raised. This suggests the possibility of pre-diabetes. An Oral Glucose Tolerance Test (OGTT) is recommended. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "> 108",
          "fbg_result": "Pre-Diabetic and Diabetic",
          "hba1c_range": ">= 7.0",
          "hba1c_result": "Diabetic",
          "recommendations": "Both your fasting blood glucose and HbA1c levels are raised. This suggests the possibility of diabetes. An Oral Glucose Tolerance Test (OGTT) is recommended. Please consult our doctor for further medical advice."
        }
      ],
      "pre_diagnosed_diabetes": [
        {
          "fbg_range": "> 108",
          "fbg_result": "Pre-Diabetic and Diabetic",
          "hba1c_range": "Not specified",
          "hba1c_result": "Not specified",
          "recommendations": "Your fasting blood glucose level is high. This suggests the possibility of sub-optimally controlled diabetes. A review of your current treatment is recommended. Dietary changes and regular exercise can help improve your blood glucose level. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "Not specified",
          "fbg_result": "Not specified",
          "hba1c_range": "7.1 - 8.0",
          "hba1c_result": "Sub-optimally Controlled",
          "recommendations": "Your HbA1c level is high. This is suggestive of sub-optimally controlled diabetes. A review of your current treatment is recommended. Dietary changes and regular exercise can help improve your HbA1c level. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "Not specified",
          "fbg_result": "Not specified",
          "hba1c_range": "> 8.0",
          "hba1c_result": "Poorly-Controlled",
          "recommendations": "Your HbA1c level is high. This is suggestive of poorly controlled diabetes. A review of your current treatment is recommended. Dietary changes and regular exercise can help improve your HbA1c level. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "< 70",
          "fbg_result": "Low",
          "hba1c_range": "<= 7.0",
          "hba1c_result": "Well-Controlled",
          "recommendations": ""
        },
        {
          "fbg_range": "< 70",
          "fbg_result": "Low",
          "hba1c_range": "7.1 - 8.0",
          "hba1c_result": "Sub-optimally Controlled",
          "recommendations": "Your fasting blood glucose level is borderline low. It could be due to prolonged fasting. However, your HbA1c level is high. This is suggestive of sub-optimally controlled diabetes. A review of your current treatment is recommended. Dietary changes and regular exercise can help improve your HbA1c level. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "< 70",
          "fbg_result": "Low",
          "hba1c_range": "> 8.0",
          "hba1c_result": "Poorly-Controlled",
          "recommendations": "Your fasting blood glucose level is borderline low. It could be due to prolonged fasting. However, your HbA1c level is high. This is suggestive of poorly controlled diabetes. A review of your current treatment is recommended. Dietary changes and regular exercise can help improve your HbA1c level. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "70 to <= 108",
          "fbg_result": "Normal",
          "hba1c_range": "<= 7.0",
          "hba1c_result": "Well-Controlled",
          "recommendations": ""
        },
        {
          "fbg_range": "70 to <= 108",
          "fbg_result": "Normal",
          "hba1c_range": "7.1 - 8.0",
          "hba1c_result": "Sub-optimally Controlled",
          "recommendations": "Your fasting blood glucose level is within normal limits, but your HbA1c level is above the normal limits. This is suggestive of sub-optimally controlled diabetes. A review of your current treatment is recommended. Dietary changes and regular exercise can help improve your HbA1c level. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "70 to <= 108",
          "fbg_result": "Normal",
          "hba1c_range": "> 8.0",
          "hba1c_result": "Poorly-Controlled",
          "recommendations": "Your fasting blood glucose level is within normal limits, but your HbA1c level is raised. This is suggestive of poorly controlled diabetes. A review of your current treatment is recommended. Dietary changes and regular exercise can help improve your HbA1c level. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "> 108",
          "fbg_result": "Pre-Diabetic and Diabetic",
          "hba1c_range": "<= 7.0",
          "hba1c_result": "Well-Controlled",
          "recommendations": ""
        },
        {
          "fbg_range": "> 108",
          "fbg_result": "Pre-Diabetic and Diabetic",
          "hba1c_range": "7.1 - 8.0",
          "hba1c_result": "Suboptimally-Controlled",
          "recommendations": "Both your fasting blood glucose and HbA1c levels are above the normal limit. This is suggestive of sub-optimally controlled diabetes. A review of your current treatment is recommended. Dietary changes and regular exercise can help improve your HbA1c level. Please consult our doctor for further medical advice."
        },
        {
          "fbg_range": "> 108",
          "fbg_result": "Pre-Diabetic and Diabetic",
          "hba1c_range": "> 8.0",
          "hba1c_result": "Poorly-Controlled",
          "recommendations": "Both your fasting blood glucose and HbA1c levels are raised.This is suggestive of poorly controlled diabetes. A review of your current treatment is recommended. Dietary changes and regular exercise can help improve your HbA1c level. Please consult our doctor for further medical advice."
        }
      ]
    }
  }
}